/*\
 * dumpexe.cxx
 *
 * Copyright (c) 2015 - Geoff R. McLane
 * Licence: GNU GPL version 2
 *
 * Also reviewed : http://www.skynet.ie/~caolan/pub/winresdump/winresdump/doc/pefile.html
 *
\*/

#include <stdio.h>
#include <string.h> // for strdup(), ...
#include <Windows.h>
#include <Dbghelp.h>
#include <time.h>
#include <iostream>      

using namespace std;

// other includes
#ifndef SPRTF
#define SPRTF printf
#endif
#ifndef MEOR
#ifdef WIN32
#define MEOR "\r\n"
#else
#define MEOR "\n"
#endif
#endif

// forward ref
int test_main();


/*

//////////////////////////////////////////////////////////////////////////////////
typedef struct _IMAGE_NT_HEADERS {
DWORD                 Signature;
IMAGE_FILE_HEADER     FileHeader;
IMAGE_OPTIONAL_HEADER OptionalHeader;
} IMAGE_NT_HEADERS, *PIMAGE_NT_HEADERS;

typedef struct _IMAGE_NT_HEADERS64 {
DWORD Signature;
IMAGE_FILE_HEADER FileHeader;
IMAGE_OPTIONAL_HEADER64 OptionalHeader;
} IMAGE_NT_HEADERS64, *PIMAGE_NT_HEADERS64;

//
// Optional header format.
//

typedef struct _IMAGE_OPTIONAL_HEADER {
//
// Standard fields.
//

WORD    Magic;
BYTE    MajorLinkerVersion;
BYTE    MinorLinkerVersion;
DWORD   SizeOfCode;
DWORD   SizeOfInitializedData;
DWORD   SizeOfUninitializedData;
DWORD   AddressOfEntryPoint;
DWORD   BaseOfCode;
DWORD   BaseOfData;

//
// NT additional fields.
//

DWORD   ImageBase;
DWORD   SectionAlignment;
DWORD   FileAlignment;
WORD    MajorOperatingSystemVersion;
WORD    MinorOperatingSystemVersion;
WORD    MajorImageVersion;
WORD    MinorImageVersion;
WORD    MajorSubsystemVersion;
WORD    MinorSubsystemVersion;
DWORD   Win32VersionValue;
DWORD   SizeOfImage;
DWORD   SizeOfHeaders;
DWORD   CheckSum;
WORD    Subsystem;
WORD    DllCharacteristics;
DWORD   SizeOfStackReserve;
DWORD   SizeOfStackCommit;
DWORD   SizeOfHeapReserve;
DWORD   SizeOfHeapCommit;
DWORD   LoaderFlags;
DWORD   NumberOfRvaAndSizes;
IMAGE_DATA_DIRECTORY DataDirectory[IMAGE_NUMBEROF_DIRECTORY_ENTRIES];
} IMAGE_OPTIONAL_HEADER32, *PIMAGE_OPTIONAL_HEADER32;

typedef struct _IMAGE_ROM_OPTIONAL_HEADER {
//
// Standard fields.
//
WORD   Magic;
BYTE   MajorLinkerVersion;
BYTE   MinorLinkerVersion;
DWORD  SizeOfCode;
DWORD  SizeOfInitializedData;
DWORD  SizeOfUninitializedData;
DWORD  AddressOfEntryPoint;
DWORD  BaseOfCode;
//
// NT additional fields.
//
DWORD  BaseOfData;
DWORD  BaseOfBss;
DWORD  GprMask;
DWORD  CprMask[4];
DWORD  GpValue;
} IMAGE_ROM_OPTIONAL_HEADER, *PIMAGE_ROM_OPTIONAL_HEADER;

typedef struct _IMAGE_OPTIONAL_HEADER64 {
//
// Standard fields.
//
WORD        Magic;
BYTE        MajorLinkerVersion;
BYTE        MinorLinkerVersion;
DWORD       SizeOfCode;
DWORD       SizeOfInitializedData;
DWORD       SizeOfUninitializedData;
DWORD       AddressOfEntryPoint;
DWORD       BaseOfCode;
//
// NT additional fields.
//
ULONGLONG   ImageBase;
DWORD       SectionAlignment;
DWORD       FileAlignment;
WORD        MajorOperatingSystemVersion;
WORD        MinorOperatingSystemVersion;
WORD        MajorImageVersion;
WORD        MinorImageVersion;
WORD        MajorSubsystemVersion;
WORD        MinorSubsystemVersion;
DWORD       Win32VersionValue;
DWORD       SizeOfImage;
DWORD       SizeOfHeaders;
DWORD       CheckSum;
WORD        Subsystem;
WORD        DllCharacteristics;
ULONGLONG   SizeOfStackReserve;
ULONGLONG   SizeOfStackCommit;
ULONGLONG   SizeOfHeapReserve;
ULONGLONG   SizeOfHeapCommit;
DWORD       LoaderFlags;
DWORD       NumberOfRvaAndSizes;
IMAGE_DATA_DIRECTORY DataDirectory[IMAGE_NUMBEROF_DIRECTORY_ENTRIES];
} IMAGE_OPTIONAL_HEADER64, *PIMAGE_OPTIONAL_HEADER64;

#define IMAGE_NT_OPTIONAL_HDR32_MAGIC      0x10b
#define IMAGE_NT_OPTIONAL_HDR64_MAGIC      0x20b
#define IMAGE_ROM_OPTIONAL_HDR_MAGIC       0x107

#ifdef _WIN64
typedef IMAGE_OPTIONAL_HEADER64             IMAGE_OPTIONAL_HEADER;
typedef PIMAGE_OPTIONAL_HEADER64            PIMAGE_OPTIONAL_HEADER;
#define IMAGE_NT_OPTIONAL_HDR_MAGIC         IMAGE_NT_OPTIONAL_HDR64_MAGIC
#else
typedef IMAGE_OPTIONAL_HEADER32             IMAGE_OPTIONAL_HEADER;
typedef PIMAGE_OPTIONAL_HEADER32            PIMAGE_OPTIONAL_HEADER;
#define IMAGE_NT_OPTIONAL_HDR_MAGIC         IMAGE_NT_OPTIONAL_HDR32_MAGIC
#endif

////////////////////////////////////////////////////////////////////////////////////
typedef struct _IMAGE_SECTION_HEADER {
BYTE  Name[IMAGE_SIZEOF_SHORT_NAME];
union {
DWORD PhysicalAddress;
DWORD VirtualSize;
} Misc;
DWORD VirtualAddress;
DWORD SizeOfRawData;
DWORD PointerToRawData;
DWORD PointerToRelocations;
DWORD PointerToLinenumbers;
WORD  NumberOfRelocations;
WORD  NumberOfLinenumbers;
DWORD Characteristics;
} IMAGE_SECTION_HEADER, *PIMAGE_SECTION_HEADER;

 */

static const char *module = "dumpexe";

static const char *usr_input = 0;

void give_help( char *name )
{
    printf("%s: usage: [options] usr_input\n", module);
    printf("Options:\n");
    printf(" --help  (-h or -?) = This help and exit(0)\n");
    // TODO: More help
}

static HANDLE hFile = 0;
static HANDLE hFileMapping = 0;
static LPVOID lpFileBase = 0;
//static PIMAGE_DOS_HEADER dosHeader;
//static PIMAGE_NT_HEADERS pNTHeader;
//static DWORD64 base;
//static DWORD64 exportsStartRVA, exportsEndRVA;
//static PIMAGE_EXPORT_DIRECTORY exportDir;
static int fDumpFileHeader = 1;

void CloseMappedFile(const char *fileName)
{
    CloseHandle(hFile);
    CloseHandle(hFileMapping);
}

typedef struct tagWORD_FLAG_DESCRIPTIONS {
    WORD    flag;
    PSTR    name;
} WORD_FLAG_DESCRIPTIONS, *PWORD_FLAG_DESCRIPTIONS;

/////////////////////////////////////////////////////////////////
// 20140719 UPDATE
// Bitfield values and names for the IMAGE_FILE_HEADER flags
WORD_FLAG_DESCRIPTIONS ImageFileHeaderCharacteristics[] = {
    { IMAGE_FILE_RELOCS_STRIPPED,"RELOCS_STRIPPED" }, // 0x0001  // Relocation info stripped from file.
    { IMAGE_FILE_EXECUTABLE_IMAGE,"EXECUTABLE_IMAGE" }, // 0x0002  // File is executable  (i.e. no unresolved externel references).
    { IMAGE_FILE_LINE_NUMS_STRIPPED,"LINE_NUMS_STRIPPED" }, // 0x0004  // Line nunbers stripped from file.
    { IMAGE_FILE_LOCAL_SYMS_STRIPPED,"LOCAL_SYMS_STRIPPED" }, // 0x0008  // Local symbols stripped from file.
    { IMAGE_FILE_AGGRESIVE_WS_TRIM,"AGGRESIVE_WS_TRIM" }, // 0x0010  // Agressively trim working set
    { IMAGE_FILE_LARGE_ADDRESS_AWARE,"LARGE_ADDRESS_AWARE" }, // 0x0020  // App can handle >2gb addresses
    { IMAGE_FILE_BYTES_REVERSED_LO,"BYTES_REVERSED_LO" }, //  0x0080  // Bytes of machine word are reversed.
    { IMAGE_FILE_32BIT_MACHINE,"32BIT_MACHINE" }, // 0x0100  // 32 bit word machine.
    { IMAGE_FILE_DEBUG_STRIPPED,"DEBUG_STRIPPED" }, // 0x0200  // Debugging info stripped from file in .DBG file
    { IMAGE_FILE_REMOVABLE_RUN_FROM_SWAP,"REMOVABLE_RUN_FROM_SWAP" }, // 0x0400  // If Image is on removable media, copy and run from the swap file.
    { IMAGE_FILE_NET_RUN_FROM_SWAP,"NET_RUN_FROM_SWAP" }, // 0x0800  // If Image is on Net, copy and run from the swap file.
    { IMAGE_FILE_SYSTEM,"SYSTEM" }, //                    0x1000  // System File.
    { IMAGE_FILE_DLL,"DLL" }, //                       0x2000  // File is a DLL.
    { IMAGE_FILE_UP_SYSTEM_ONLY,"UP_SYSTEM_ONLY" }, //            0x4000  // File should only be run on a UP machine
    { IMAGE_FILE_BYTES_REVERSED_HI,"BYTES_REVERSED_HI" } //       0x8000  // Bytes of machine word are reversed.
};

#define NUMBER_IMAGE_HEADER_FLAGS \
    (sizeof(ImageFileHeaderCharacteristics) / sizeof(WORD_FLAG_DESCRIPTIONS))


// 20140614: Increase Machine Type Names - from WinNT.h
static PSTR GetMachineTypeName(WORD wMachineType)
{
    switch (wMachineType)
    {
    case IMAGE_FILE_MACHINE_UNKNOWN: return "Unknown";  // 0
    case IMAGE_FILE_MACHINE_I386: return "Intel 386";   // 0x014c  // Intel 386.
    case IMAGE_FILE_MACHINE_R3000: return "MIPS-LE";    // 0x0162  // MIPS little-endian, 0x160 big-endian
    case IMAGE_FILE_MACHINE_R4000: return "MIPS-LE";    // 0x0166  // MIPS little-endian
    case IMAGE_FILE_MACHINE_R10000: return "MIPS-LE";   // 0x0168  // MIPS little-endian
    case IMAGE_FILE_MACHINE_WCEMIPSV2: return "MIPS-LE_WCE"; // 0x0169  // MIPS little-endian WCE v2
    case IMAGE_FILE_MACHINE_ALPHA: return "Alpha_AXP";  // 0x0184  // Alpha_AXP
    case IMAGE_FILE_MACHINE_SH3: return "SH3-LE";       // 0x01a2  // SH3 little-endian
    case IMAGE_FILE_MACHINE_SH3DSP: return "SH3DSP";    // 0x01a3
    case IMAGE_FILE_MACHINE_SH3E: return "SH3E-LE";     // 0x01a4  // SH3E little-endian
    case IMAGE_FILE_MACHINE_SH4: return "SH4-LE";       // 0x01a6  // SH4 little-endian
    case IMAGE_FILE_MACHINE_SH5: return "SH5";          // 0x01a8  // SH5
    case IMAGE_FILE_MACHINE_ARM: return "ARM-LE";       // 0x01c0  // ARM Little-Endian
    case IMAGE_FILE_MACHINE_THUMB: return "Thumb";      // 0x01c2
    case IMAGE_FILE_MACHINE_AM33: return "ARM33";       // 0x01d3
    case IMAGE_FILE_MACHINE_POWERPC: return "PowerPC-LE"; // 0x01F0  // IBM PowerPC Little-Endian
    case IMAGE_FILE_MACHINE_POWERPCFP: return "PowerPCFP"; // 0x01f1
    case IMAGE_FILE_MACHINE_IA64: return "Intel 64";           // 0x0200  // Intel 64
    case IMAGE_FILE_MACHINE_MIPS16: return "MIPS16";    // 0x0266  // MIPS
    case IMAGE_FILE_MACHINE_ALPHA64: return "Alpha64";  // 0x0284  // ALPHA64
    case IMAGE_FILE_MACHINE_MIPSFPU: return "MIPSFPU";  // 0x0366  // MIPS
    case IMAGE_FILE_MACHINE_MIPSFPU16: return "MIPSFPU16";  // 0x0466  // MIPS
                                                            // case IMAGE_FILE_MACHINE_AXP64             IMAGE_FILE_MACHINE_ALPHA64
    case IMAGE_FILE_MACHINE_TRICORE: return "infineon"; // 0x0520  // Infineon
    case IMAGE_FILE_MACHINE_CEF: return "CEF";          // 0x0CEF
    case IMAGE_FILE_MACHINE_EBC: return "EFI-BC";       // 0x0EBC  // EFI Byte Code
    case IMAGE_FILE_MACHINE_AMD64: return "AMD64-K8";   // 0x8664  // AMD64 (K8)
    case IMAGE_FILE_MACHINE_M32R: return "M32R-LE";     // 0x9041  // M32R little-endian
    case IMAGE_FILE_MACHINE_CEE: return "CCE";          // 0xC0EE
    }
    return "UNLISTED";
}

static char * pedump_ctime(time_t * ptm)
{
    char * ctm = NULL;
#ifdef WIN32
    __time32_t * timer = (__time32_t *)ptm;
    ctm = _ctime32(timer); // NOTE: Returns buffer with "\n" appended
#else
    ctm = ctime(ptm); // this will use 64-bit time
#endif

    if (ctm == NULL)  // if OUT OF RANGE
        ctm = "Out of range" MEOR;

    return ctm;
}

//
// Dump the IMAGE_FILE_HEADER for a PE file or an OBJ
//
void DumpHeader(PIMAGE_FILE_HEADER pImageFileHeader)
{
    UINT headerFieldWidth = 30;
    UINT i;

    //add_2_machine_list(pImageFileHeader->Machine);
    if (fDumpFileHeader)
    {
        SPRTF("PE File Header:\n");

        SPRTF("  %-*s%04X (%s)\n", headerFieldWidth, "Machine:",
            pImageFileHeader->Machine,
            GetMachineTypeName(pImageFileHeader->Machine));
        SPRTF("  %-*s%04X\n", headerFieldWidth, "Number of Sections:",
