// DumpWAV.c
// FIX20081204 - Added -wav to process WAVE file
// from : http://technology.niagarac.on.ca/courses/ctec1631/WavFileFormat.html
// from : http://www.sonicspot.com/guide/wavefiles.html
#include "dump4.h"
extern void ProcessHex( PBYTE pb, DWORD len );

/* =========================================================
Wave File Header 
Wave File Chunks 
 Format Chunk - "fmt " 
 Data Chunk - "data" 
 Fact Chunk - "fact" 
 Cue Chunk - "cue " 
 Playlist Chunk - "plst" 
 Associated Data List Chunk - "list" 
 Label Chunk - "labl" 
 Labeled Text Chunk - "ltxt" 
 Note Chunk - "note" 
 Sample Chunk - "smpl" 
 Instrument Chunk - "inst" 

 Format Chunk
 Offset Size Description Value 
0x00 4 Chunk ID "fmt " (0x666D7420) 
0x04 4 Chunk Data Size 16 + extra format bytes 
0x08 2 Compression code 1 - 65,535 
0x0a 2 Number of channels 1 - 65,535 
0x0c 4 Sample rate 1 - 0xFFFFFFFF 
0x10 4 Average bytes per second 1 - 0xFFFFFFFF 
0x14 2 Block align 1 - 65,535 
0x16 2 Significant bits per sample 2 - 65,535 
0x18 2 Extra format bytes 0 - 65,535 
0x1a Extra format bytes * 
 where compression code =
 Code Description 
0 (0x0000) Unknown 
1 (0x0001) PCM/uncompressed 
2 (0x0002) Microsoft ADPCM 
6 (0x0006) ITU G.711 a-law 
7 (0x0007) ITU G.711 µ-law 
17 (0x0011) IMA ADPCM 
20 (0x0016) ITU G.723 ADPCM (Yamaha) 
49 (0x0031) GSM 6.10 
64 (0x0040) ITU G.721 ADPCM 
80 (0x0050) MPEG 
65,536 (0xFFFF) Experimental 

Time Channel Value 
0 1 (left) 0x0053 
  2 (right) 0x0024 
1 1 (left) 0x0057 

0x1A Text 

Sampler Chunk - "smpl"
Sampler Chunk Format 
Offset Size Description Value 
0x00 4 Chunk ID "smpl" (0x736D706C) 
0x04 4 Chunk Data Size 36 + (Num Sample Loops * 24) + Sampler Data 
0x08 4 Manufacturer 0 - 0xFFFFFFFF 
0x0C 4 Product 0 - 0xFFFFFFFF 
0x10 4 Sample Period 0 - 0xFFFFFFFF 
0x14 4 MIDI Unity Note 0 - 127 
0x18 4 MIDI Pitch Fraction 0 - 0xFFFFFFFF 
0x1C 4 SMPTE Format 0, 24, 25, 29, 30 
0x20 4 SMPTE Offset 0 - 0xFFFFFFFF 
0x24 4 Num Sample Loops 0 - 0xFFFFFFFF 
0x28 4 Sampler Data 0 - 0xFFFFFFFF 
0x2C List of Sample Loops 

where -
Manufacturer
The value is stored with some extra information to enable translation 
to the value used in a MIDI System Exclusive transmission to the sampler.
The high byte indicates the number of low order bytes (1 or 3) that are 
valid for the manufacturer code. For example, the value for Digidesign 
will be 0x01000013 (0x13) and the value for Microsoft will be 
0x30000041 (0x00, 0x00, 0x41). See the MIDI Manufacturers List for a list.

from : 
The MIDI Manufacturer's Association (MMA) assigns each manufacturer 
of MIDI products a unique ID which is used in conjunction with the 
model ID (assigned by the manufacturer) to identify which product is 
the intended receiver of their system exclusive messages. This way 
other products receiving the same messages can ignore them.

Sampler Chunk Format 
Manufacturer

ID Manufacturer 
0 (0x00) Unknown 
1 (0x01) Sequential Circuits 
2 (0x02) Big Briar 
3 (0x03) Octave / Plateau 
4 (0x04) Moog 
5 (0x05) Passport Designs 
6 (0x06) Lexicon 
7 (0x07) Kurzweil 
8 (0x08) Fender 
9 (0x09) Gulbransen 
10 (0x0A) Delta Labs 
11 (0x0B) Sound Comp. 
12 (0x0C) General Electro 
13 (0x0D) Techmar 
14 (0x0E) Matthews Research 
16 (0x10) Oberheim 
17 (0x11) PAIA 
18 (0x12) Simmons 
19 (0x13) DigiDesign 
20 (0x14) Fairlight 
21 (0x15) JL Cooper 
22 (0x16) Lowery 
23 (0x17) Lin 
24 (0x18) Emu 
27 (0x1B) Peavey 
32 (0x20) Bon Tempi 
33 (0x21) S.I.E.L. 
35 (0x23) SyntheAxe 
36 (0x24) Hohner 
37 (0x25) Crumar 
38 (0x26) Solton 
39 (0x27) Jellinghaus Ms 
40 (0x28) CTS 
41 (0x29) PPG 
47 (0x2F) Elka 
54 (0x36) Cheetah 
62 (0x3E) Waldorf 
64 (0x40) Kawai 
65 (0x41) Roland 
66 (0x42) Korg 
67 (0x43) Yamaha 
68 (0x44) Casio 
70 (0x46) Kamiya Studio 
71 (0x47) Akai 
72 (0x48) Victor 
75 (0x4B) Fujitsu 
76 (0x4C) Sony 
78 (0x4E) Teac 
80 (0x50) Matsushita 
81 (0x51) Fostex 
82 (0x52) Zoom 
84 (0x54) Matsushita 
85 (0x55) Suzuki 
86 (0x56) Fuji Sound 
87 (0x57) Acoustic Technical Laboratory 

   ========================================================= */


/* RIFF Format
   from : http://netghost.narod.ru/gff/graphics/summary/micriff.htm

   Also Known As: RIFF, 
   Resource Interchange File Format, RIFX, .WAV, .AVI, .BND, .RMI, .RDI 

Examples of data that may be stored in RIFF files are: 
Audio/visual interleaved data (.AVI) 
Waveform data (.WAV) 
Bitmapped data (.RDI) 
MIDI information (.RMI) 
A bundle of other RIFF files (.BND) 

 Every RIFF chunk has the following basic structure: 
typedef struct _Chunk
{
    DWORD ChunkId;              /+* Chunk ID marker *+/
    DWORD ChunkSize;            /+* Size of the chunk data in bytes *+/
    BYTE ChunkData[ChunkSize];  /+* The chunk data *+/
} CHUNK;

ChunkId contains four ASCII characters that identify the data the chunk contains.
For example, the characters RIFF are used to identify chunks containing RIFF data.
If an ID is smaller than four characters, it is padded on the right using 
spaces (ASCII 32). Note that RIFF files are written in little-endian byte order.
Files written using the big-endian byte ordering scheme have the identifier RIFX. 

struct _RIFF   /+* "RIFF" *+/
{
    struct _AVICHUNK   /+* "AVI " *+/
    {
        struct _LISTHEADERCHUNK   /+* "hdrl" *+/
        {
            AVIHEADER AviHeader;     /+* "avih" *+/
            struct _LISTHEADERCHUNK  /+* "strl" *+/
            {
                AVISTREAMHEADER	StreamHeader; /+* "strh" *+/
                AVISTREAMFORMAT	StreamFormat; /+* "strf" *+/
                AVISTREAMDATA	StreamData;   /+* "strd" *+/
            }
        }
        struct _LISTMOVIECHUNK  /+* "movi" *+/
        {
            struct _LISTRECORDCHUNK  /+* "rec " *+/
            {
                /+* Subchunk 1 *+/
                /+* Subchunk 2 *+/
                /+* Subchunk N *+/
            }
        }
        struct _AVIINDEXCHUNK  /+* "idx1" *+/
        {
            /+* Index data *+/
        }
    }
}

typedef struct _StreamHeader
{
    char  DataType[4];           /+* Chunk identifier ("strl") *+/
    char  DataHandler[4];        /+* Device handler identifier *+/
    DWORD Flags;                 /+* Data parameters *+/
    DWORD Priority;              /+* Set to 0 *+/
    DWORD InitialFrames;         /+* Number of initial audio frames *+/
    DWORD TimeScale;             /+* Unit used to measure time *+/
    DWORD DataRate;              /+* Data rate of playback *+/
    DWORD StartTime;             /+* Starting time of AVI data *+/
    DWORD DataLength;            /+* Size of AVI data chunk *+/
    DWORD SuggestedBufferSize;   /+* Minimum playback buffer size *+/
    DWORD Quality;               /+* Sample quailty factor *+/
    DWORD SampleSize;            /+* Size of the sample in bytes *+/
} STREAMHEADER;

DataType contains a 4-character identifier indicating the type of data the 
stream header refers to. Identifiers supported by the current version 
of the RIFF format are: vids for video data and auds for audio data. 

typedef struct _AviIndex
{
    DWORD Identifier;    /+* Chunk identifier reference *+/
    DWORD Flags;         /+* Type of chunk referenced *+/
    DWORD Offset;        /+* Position of chunk in file *+/
    DWORD Length;        /+* Length of chunk in bytes *+/
} AVIINDEX;

Identifier contains the 4-byte identifier of the chunk it
references (strh, strf, strd, and so on). 

JUNK Chunk
One other type of chunk that is commonly encountered in an AVI chunk
is the padding or JUNK chunk (so named because its chunk identifier is JUNK).
This chunk is used to pad data out to specific boundaries 
(for example, CD-ROMs use 2048-byte boundaries). The size of the chunk 
is the number of bytes of padding it contains. If you are reading AVI 
data, do not use use the data in the JUNK chunk. Skip it when reading 
and preserve it when writing. The JUNK chunk uses the standard chunk structure: 

typedef struct _JunkChunk
{
    DWORD ChunkId;             /+* Chunk ID marker (JUNK)*+/
    DWORD PaggingSize;         /+* Size of the padding in bytes *+/
    BYTE Padding[ChunkSize];   /+* Padding *+/
} JUNKCHUNK;


 * ------------------------------------------------------------- */

#pragma pack(push,1)
// Header: 12 bytes
typedef struct tagWAVHEADER {
   char chRiff[4];   // 0 - 3  "RIFF" (ASCII Characters)
   DWORD dwFileLen;  // 4 - 7  Total Length Of Package To Follow (Binary, little endian)
   char chWave[4];   // 8 - 11 "WAVE" (ASCII Characters)
}WAVHEADER, * PWAVHEADER;

typedef struct _Chunk
{
    char  ChunkId[4];           /* Chunk ID marker */
    DWORD ChunkSize;            /* Size of the chunk data in bytes */
    // BYTE ChunkData[ChunkSize];  /* The chunk data */
} CHUNK, * PCHUNK;

// CHUNK TYPES
#define  CH_NONE  0
#define  CH_RIFF  1
#define  CH_fmt   2   // Format Chunk - "fmt " 
#define  CH_data  3   // Data Chunk - "data" 
#define  CH_fact  4   // Fact Chunk - "fact" 
#define  CH_cue   5   // Cue Chunk - "cue " 
#define  CH_plst  6   // Playlist Chunk - "plst" 
#define  CH_list  7   // Associated Data List Chunk - "list" 
#define  CH_labl  8   // Label Chunk - "labl" 
#define  CH_ltxt  9   // Labeled Text Chunk - "ltxt"
#define  CH_note  10  // Note Chunk - "note" 
#define  CH_smpl  11  // Sample Chunk - "smpl" 
#define  CH_inst  12  // Instrument Chunk - "inst" 


/* -----------------------------------------
Offset Size Description Value 
0x00 4 Chunk ID "fmt " (0x666D7420) 
0x04 4 Chunk Data Size 16 + extra format bytes 
0x08 2 Compression code 1 - 65,535 
0x0a 2 Number of channels 1 - 65,535 
0x0c 4 Sample rate 1 - 0xFFFFFFFF 
0x10 4 Average bytes per second 1 - 0xFFFFFFFF 
0x14 2 Block align 1 - 65,535 
0x16 2 Significant bits per sample 2 - 65,535 

0x18 2 Extra format bytes 0 - 65,535 
0x1a Extra format bytes * 
OR
Next, the fmt chunk describes the sample format:
  12      4 bytes  'fmt '
  16      4 bytes  0x00000010     // Length of the fmt data (16 bytes)
  20      2 bytes  0x0001         // Format tag: 1 = PCM
  22      2 bytes  <channels>     // Channels: 1 = mono, 2 = stereo
  24      4 bytes  <sample rate>  // Samples per second: e.g., 44100
  28      4 bytes  <bytes/second> // sample rate * block align
  32      2 bytes  <block align>  // channels * bits/sample / 8
  34      2 bytes  <bits/sample>  // 8 or 16

   ----------------------------------------- */
// Format: 24 bytes
typedef struct tagWAVFORMAT {
   char chFmt[4];    // 0 - 3   "fmt " (ASCII Characters)
   DWORD dwFormLen;  // 4 - 7   Length Of FORMAT Chunk (Binary, usually 0x10)
   WORD wComprssion; // 8 - 9   Compression code 1 - 65,535, usually/always 0x01
   WORD wChannels;   // 10 - 11 Channel Numbers (Always 0x01=Mono, 0x02=Stereo)
   DWORD dwRate;     // 12 - 15 Sample Rate (Binary, in Hz)
   DWORD dwBperS;    // 16 - 19 Bytes Per Second
   WORD  wBperS;     // 20 - 21 Bytes Per Sample
   WORD  wBitsperSample;   // 22 - 23 Bits Per Sample
} WAVFORMAT, * PWAVFORMAT;

//Data: 8 bytes + sound data
typedef struct tagWAVDATA {
   char chData[4];   // 0 - 3   "data" (ASCII Characters)
   DWORD dwLen;      // 4 - 7   Length Of Data To Follow
//   char  data[1];    // 8 - end  Data (Samples)
}WAVDATA, * PWAVDATA;

// there are other optional chunks
// Associated Data List Chunk - "list"
// An associated data list chunk is used to define text labels
// and names which are associated with the cue points to provide
// each text label or name a position. 
typedef struct tagWAVLIST {
   // Offset Size Description Value 
   char chList[4];   // 0x00 4 Chunk ID "list" (0x6C696E74) 
   DWORD dwlen;      // 0x04 4 Chunk Data Size depends on contained text 
   char chID[4];     // 0x08 4 Type ID "adtl" (0x6164746C) 
   // 0x0c List of Text Labels and Names 
}WAVLIST, * PWAVLIST;

// Label Chunk Format 
typedef struct tagWAVLTXT {
   // Offset Size Description Value 
   // 0x00 4 Chunk ID "ltxt" (0x6C747874) 
   DWORD Chunk_ID;
   //0x04 4 Chunk Data Size depends on contained text 
   DWORD Chunk_Size;
   // 0x08 4 Cue Point ID 0 - 0xFFFFFFFF 
   DWORD Cue_ID;
   //0x0c 4 Sample Length 0 - 0xFFFFFFFF 
   DWORD Length;
   //0x10 4 Purpose ID 0 - 0xFFFFFFFF 
   DWORD Purpose_ID;
   //0x12 2 Country 0 - 0xFFFF 
   WORD Country;
   //0x14 2 Language 0 - 0xFFFF 
   WORD Language;
   //0x16 2 Dialect 0 - 0xFFFF 
   WORD Dialect;
   //0x18 2 Code Page 0 - 0xFFFF 
   WORD  Code_page;
   //0x1A Text 
}WAVLTXT, * PWAVLTXT;

typedef struct tagWAVFILE {
   WAVHEADER   sWavHeader;
   WAVFORMAT   sWavFormat;
   WAVDATA     sWavData;
}WAVFILE, * PWAVFILE;

/* AVI Header Subchunk
   The first mandatory LIST chunk contains the main AVI header 
   subchunk and has the identifier hdrl. The information in the header 
   subchunk defines the format of the entire AVI chunk. The hdrl 
   chunk must appear as the first chunk within the AVI chunk. 
   The format of the header subchunk is the following: 
 * ------------------------------------------------------------- */
typedef struct _AVIHeader
{
    DWORD TimeBetweenFrames;     /* Time delay between frames */
    DWORD MaximumDataRate;       /* Data rate of AVI data */
    DWORD PaddingGranularity;    /* Size of single unit of padding */
    DWORD Flags;                 /* Data parameters */
    DWORD TotalNumberOfFrames;   /* Number of video frame stored */
    DWORD NumberOfInitialFrames; /* Number of preview frames */
    DWORD NumberOfStreams;       /* Number of data streams in chunk*/
    DWORD SuggestedBufferSize;   /* Minimum playback buffer size */
    DWORD Width;                 /* Width of video frame in pixels */
    DWORD Height;                /* Height of video frame in pixels*/
    DWORD TimeScale;             /* Unit used to measure time */
    DWORD DataRate;              /* Data rate of playback */
    DWORD StartTime;             /* Starting time of AVI data */
    DWORD DataLength;            /* Size of AVI data chunk */
} AVIHEADER;


// Sampler Chunk - "smpl"
// Sampler Chunk Format 
typedef struct _WAVSMPL {
   DWORD Chunk_ID;   // "smpl" (0x736D706C) 
   DWORD Chunk_Size; // 0x04 4 Chunk Data Size 36 + (Num Sample Loops * 24) + Sampler Data 
   DWORD Manufacturer;  // 0x08 4 Manufacturer 0 - 0xFFFFFFFF 
   DWORD Product;    // 0x0C 4 Product 0 - 0xFFFFFFFF 
   DWORD Samp_Period;   // 0x10 4 Sample Period 0 - 0xFFFFFFFF 
   DWORD MIDI_Unit;  // 0x14 4 MIDI Unity Note 0 - 127 
   DWORD MIDI_Pitch; // 0x18 4 MIDI Pitch Fraction 0 - 0xFFFFFFFF 
   DWORD SMPTE_Form; // 0x1C 4 SMPTE Format 0, 24, 25, 29, 30 
   DWORD SMPTE_Off;  // 0x20 4 SMPTE Offset 0 - 0xFFFFFFFF 
   DWORD Samp_Loops; // 0x24 4 Num Sample Loops 0 - 0xFFFFFFFF 
   DWORD Samp_Data;  // 0x28 4 Sampler Data 0 - 0xFFFFFFFF 
   // 0x2C List of Sample Loops 
}WAVSMPL, * PWAVSMPL;

#pragma pack(pop)

#define  wavChan_Mono   1
#define  wavChan_Stereo 2


typedef struct tagVAL2STG {
   DWORD value;
   char * stg;
}VAL2STG, * PVAL2STG;

VAL2STG sChan2Stg[] = {
   { wavChan_Mono, "Mono" },
   { wavChan_Stereo, "Stereo" },
   { 0 , 0 }
};

char * Get_Channel_String( DWORD val )
{
   PVAL2STG pv2s = &sChan2Stg[0];
   LPTSTR lptmp = &gszTmpOut[0];
   while(pv2s->stg)
   {
      if(pv2s->value == val )
         return pv2s->stg;

      pv2s++;
   }
   sprintf(lptmp, "Unknown %d", val);
   return lptmp;
}

/* ===============================
   THIS DOES NOT SEEM CORRECT!!!
// 20 - 21 Bytes Per Sample:
#define  wav_8_bit_Mono    1
#define  wav_8_bit_Stereo  2
#define  wav_16_bit_Mono   2
#define  wav_16_bit_Stereo 4

// 20 - 21 Bytes Per Sample:
VAL2STG  sBPS[] = {
   { wav_8_bit_Mono,  "8-bit Mono" },
   { wav_8_bit_Stereo,"8-bit Stereo" },
